Repository: TherapyBox/study-goal-ios
Catalog: Jisc/*.lproj/Localizable.strings
Languages: cy

source: Silver
cy: Arian

source: Gold
cy: Aur

source: Monday
cy: Dydd Llun

source: Tuesday
cy: Dydd Mawrth

source: Wednesday
cy: Dydd Mercher

source: Thursday
cy: Dydd Iau

source: Friday
cy: Dydd Gwener

source: Saturday
cy: Dydd Sadwrn

source: Sunday
cy: Dydd Sadwrn

source: Mon
cy: Llun

source: Tue
cy: Maw

source: Wed
cy: Mer

source: Thu
cy: Iau

source: Fri
cy: Gwen

source: Sat
cy: Sad

source: Sun
cy: Sul

source: New Activity
cy: Actifedd Newydd

source: View Activities
cy: Gweld Actifeddau

source: Module
cy: Modiwl

source: Activity Type
cy: Math y Actifedd

source: Choose Activity
cy: Dewis Actifedd

source: Reminder to Take Breather After
cy: Atgoffiad i Gymryd Seibiant Arol

source: hour
cy: awr

source: hours
cy: oriau

source: minute
cy: munud

source: minutes
cy: munudau

source: Start
cy: Dechrau

source: Stop
cy: Gorffen

source: Pause
cy: Saib

source: Resume
cy: Ailddechrau

source: Activity Log
cy: Log Actifeddau

source: Choose Module
cy: Dewis Modiwl

source: Note
cy: Nodyn

source: Notes
cy: Nodiadau

source: Save
cy: Cadw

source: Time Spent
cy: Amser Gwario

source: Date
cy: Dyddiad

source: Time
cy: Amser

source: All Activities
cy: Holl Actifeddau

source: Target
cy: Targed

source: Swipe left/right to navigate through your targets
cy: Taro i'r chwith/ dde i fynd trwy'r targedau

source: Add Target
cy: Adio Targed

source: In
cy: Mewn

source: Because
cy: Oherwydd

source: Any Module
cy: Unrhyw Fodiwl

source: Edit
cy: Golygu

source: Delete
cy: Dileu

source: Stats
cy: Ystadegau

source: Course Engagement
cy: Ymrwymiad y Cwrs

source: This week
cy: Wythnos yma

source: Overall
cy: Cyflawn

source: Attainment
cy: Cymhwyster

source: Very High Engagement
cy: Ymrwymiad Uchel Iawn

source: You are in top %@
cy: Rydych yn y %s o'r brig

source: You are in bottom %@
cy: Rydych yn y %s o'r gwaelod

source: No Ranking info
cy: Dim gwybodaeth

source: I have no rank to share
cy: Does dim rheng gyda fi i rhannu

source: I am in the top %@ this week
cy: Rydw i yn y %s o'r brig wythnos yma

source: I am in bottom %@ this week
cy: Rydw i yn y %s o'rÂ gwaelod wythnos yma

source: Higher Middle Engagement
cy: Ymrwymiad Uchel-Ganol

source: Activity Points
cy: Pwyntiau Actifedd

source: Last Week
cy: Wythnos Diwethaf

source: Me
cy: Fi

source: Period
cy: Cyfnod

source: Compare to
cy: Cymharu i

source: Choose Period
cy: Dewis Myfyriwr/wraig

source: Last 24 hours
cy: 24 awr diwethaf

source: Last 7 days
cy: 7Â diwrnod dwethaf

source: Last 30 days
cy: 30 diwrnod dwethaf

source: Choose Student
cy: Dewis Myfyriwr/wraig

source: No one
cy: Dim un

source: Engagement Graph
cy: Graph Ymrwymiad

source: engagement
cy: ymrwymiad

source: I have %@ activity points this week
cy: Gennyf %s o bwyntiau actifedd yr wythnos yma

source: I have %@ activity points overall
cy: Gennyf %s o bwyntiau actifedd yn gyflawn

source: Feed
cy: Porthiant

source: Activity Feed
cy: Porthiant Actifedd

source: Just a moment ago
cy: YchydigÂ eiliad yn ol

source: min ago
cy: munud yn ol

source: hours ago
cy: awr yn ol

source: On
cy: Ar

source: Post Message
cy: Postio Neges

source: Post
cy: Postio

source: Done
cy: Wedi Gorffen

source: Search
cy: Chwilio

source: New Requests
cy: Ceisiadau Newydd

source: My Friends
cy: Fy Ffrindiau

source: Pending Request
cy: Cais yn Aros

source: People on your course
cy: Pobl ar fy cwrs

source: Friends
cy: Ffrindiau

source: Hide
cy: Cyddio

source: Confirm
cy: Cadarnhau

source: Friend Request
cy: Cais Ffrind

# what_would_you_like_student_to_see
source: What would you like %@ to see?
cy: Be fyswch yn hoffi i %s ei weld?

source: What would you like your friend to see?
cy: Be fysech yn hoffi eich ffrind i weld?

source: Everything
cy: Popeth

source: My result
cy: Fy canlyniad

source: My course engagement
cy: Fy ymrwymiad cwrs

source: Send
cy: Gyrru

source: Settings
cy: Gosodiadau

source: Choose Source
cy: Dewis Ffynhonnell

source: Library
cy: Llyfrgell

source: Home Screen
cy: Sgrin Cartref

source: Trophies
cy: Tlysau

source: Language
cy: Iaith

source: English
cy: Saesneg

source: Welsh
cy: Cymraeg

source: All Friends
cy: Holl Ffrindiau

source: Select home screen
cy: Dewis scrin cartref

source: All trophies
cy: Holl tlysau

source: Select language
cy: Dewis iaith

# choose_your_institute
source: Choose your institution
cy: Dewis eich Sefydliad

source: Tap to select
cy: Tapiwch i ddewis

# log_in_to_your_account
source: Login into your account
cy: Mewngofnodi i'ch cyfrif

source: Email ID
cy: Ebost

source: Password
cy: Cyfrinair

source: Forgot Password?
cy: Anghofio Cyfrinair?

source: Log in
cy: Mewngofnodi

source: Keep me signed in
cy: CadwÂ fi wedi llofnodi mewn

source: Confirmation
cy: Cadarnhad

source: Saved Sucesfully
cy: Wedi Cadw

source: Activity Started
cy: Actifedd ar Dechrau

source: You have no modules
cy: Does dim modiwl gyda chi

source: Activity was cancelled due to short time spent
cy: Actifedd wedi ei ganslo oherwydd amser prin wedi treulio arno

source: Are you sure you want to delete this target?
cy: Ydych yn siwr am ddileu'r targed yma?

source: Are you sure you want to delete this log?
cy: Ydych yn siwr am ddileu'rÂ log yma?

source: Would you like to save the changes you made?
cy: Ydych eisiau cadw'r newidiadau sydd wedi cael ei wneud?

source: Error
cy: Gwall

source: Please enter the time spent.
cy: Mewngofnodi amser wedi cael ei wario

source: Yes
cy: Ie

source: No
cy: Na

source: Message Posted Successfully
cy: Neges wedi a Bostio'n Llwyddiannus

source: Friend Deleted Successfully
cy: Ffrind wedi ei Dileu'nÂ Llwyddiannus

source: Request Sent Successfully
cy: Cais wedi ei Yrru yn Llwyddiannus

source: Confirmed Successfully
cy: Cadarnhad Llwyddiannus

source: Are you sure you want to delete this friend?
cy: Ydych yn siwr o eisiau dileu y ffrind yma?

source: Please enter your email ID
cy: Mewnbynnu eich cyfeiriad Ebost

source: Please enter a valid email address
cy: Rhaid defnyddio cyfeiriad ebost dilys

source: Please enter your password
cy: Mewnbynnu eich cyfrinair

source: OK
cy: Iawn

source: Activity Stopped
cy: Actifedd wedi'u Hatal

source: Running Activity
cy: Actifedd yn Rhedeg

source: Friend unhidden Successfully
cy: Ffrind ddim wedi eu Cyddio

source: Friend Hidden successfully
cy: Ffrind wedi eu Cyddio

source: Something went wrong
cy: Rhywbeth wedi mynd yn anghywir

source: Deleted Successfully
cy: Dileu yn Llwyddiannus

source: Edit Target
cy: Adnewyddu Targed

source: Please enter a time target
cy: Mewngofnodwch amser targed

source: You already have a target with the same parameters set
cy: Mae targed hefo'r un gwybodaeth wedi cael ei gosod yn barod

source: Are you sure you want to delete this activity log?
cy: Ydych yn siwrÂ o eisiau dileu yr log actifedd yma?

source: Target Deleted Successfully
cy: Targed wedi ei Dileu'n Llwyddiannus

source: Target reached!
cy: Targed wedi eu gyraedd!

source: Please set a time for your stretch target
cy: Mae angen amser ar gyfer eich targed ymestyn

source: Stretch Target added
cy: Targed Ymestyn wedi ei atodi

source: Friend request sent successfully!
cy: Cais ffrind wedi ei yrru yn llwyddiannus!

source: Friend request accepted successfully!
cy: Cais ffrind wedi eiÂ dderbyn yn llwyddiannus!

source: Please complete all required fields
cy: Cwblhewch pob maes a sydd angen

source: Friend request deleted successfully!
cy: Cais ffrind wedi eiÂ ddileu yn llwyddiannus!

source: Activity successfully edited
cy: Actifedd wedi ei olygu yn llwyddiannus!

source: Record deleted successfully.
cy: Cofnod wedi ei dileu yn llwyddiannus!

source: Target saved successfully!
cy: Targed wedi ei gadw yn llwyddiannus!

source: Target edited successfully!
cy: Targed wedi ei olygu yn llwyddiannus!

source: Congratulations! Target reached!
cy: Llongyfarchiadau! Targed wedi cyraedd!

source: Stretch target saved successfully!
cy: Targed ymestyn wedi ei gadw yn llwyddiannus!

# sorry_a_stretch_target_is_already_active
source: Sorry! A stretch target is already active. You can't set other stretch target for this target until your current one is completed
cy: Sori! Mae target ymestyn ar gael yn barod. Bydd dim posib gosod target ymestyn ar gyfer y target yma, tan byddÂ eich un cyfoes wedi ei cwblhau

source: Stretch target edited successfully!
cy: Targed ymestyn wedi ei olygu yn llwyddiannus!

source: Stretch target deleted successfully.
cy: Target ymestyn wedi ei dileu yn llwyddiannus!

source: Congratulations! Stretch target completed!
cy: Llongyfarchiadau! Targed ymestyn wedi cyraedd!

# congratulations_you_have_been_awarded_this_trophy
source: Congratulations! You have been awarded "%@" trophy.
cy: Llongyfarchiadau! Rydych wedi cael gwobr o'r tlws "%s"

source: Feed deleted successfully!
cy: Porthiant wedi ei dileu yn llwyddiannus!

source: Language set successfully.
cy: Iaith wedi ei osod yn llwyddiannus!

source: Home screen set successfully!
cy: Sgrin catref wedi ei osod yn llwyddiannus!

source: Profile picture updated successfully!
cy: Llun proffil wedi cael ei diweddaru yn llwyddiannus!

source: Overall activity points
cy: Pwyntiau actifedd cyflawn

source: Last week's activity points
cy: Pwyntiau actifedd wythnos diwethaf

source: High Engagement
cy: Ymrwymiad Uchel

source: Medium - High Engagement
cy: Ymrwymiad Ganol-Uchel

source: Low - Medium Engagement
cy: Ymrwymiad Isel-Ganol

source: Low Engagement
cy: Ymrwymiad Isel

source: Library Hawk
cy: Gweilch Llyfrgell

source: Tackle
cy: Tacl

source: Hard Tackle
cy: Tacl Caled

source: Bonus Miles
cy: Milltiroedd Bonws

source: Even Madder Scientist
cy: Gwyddonwr Gwallgof

source: Top Dog
cy: Ci Brig

source: Hercule
cy: Gorchestol

source: Sherlock
cy: Ditectif

source: Exam Veteran
cy: Hynafwr Arholiadau

source: Extrovert
cy: Allblyg

source: Team Player
cy: Chwaraewr Tim

source: Cramped Hand
cy: Hen Law

source: Very Cramped Hand
cy: Hewn Law Iawn

source: T-Square
cy: Perffeithydd

source: Artist's Desk
cy: Desg Arlunydd

source: Loudspeaker
cy: Uchelseinydd

source: Fog Horn
cy: Uchel Lais Iawn

# deja_vu
source: Déjà vu
cy: Yma eto!

# deja_vu_again
source: Déjà vu again
cy: Yma eto - eto!

source: Roving Reporter
cy: Gohebydd Gyfnewidiol

source: Media Mogul
cy: Mogwl Cyfryngau

source: Poster Boy
cy: Bachgen Poster

source: Pusher
cy: Gwthiwr

source: Reacher
cy: Ymestynwr

source: Frequent Flier
cy: Hedfannwr Aml

source: Bibliophile
cy: Llyfryddiaethwr

source: Bookworm
cy: Llyfrbryf

source: Desk Jockey
cy: Rheolwr Desg

source: Key Puncher
cy: Bysell Prysyr

source: Campus Captain
cy: Capten y Campws

source: Attending
cy: Mynychu

source: Coursework/Exams
cy: Gwaith Cwrs/ Arholiadau

source: Studying (arts)
cy: Astudio (Celf)

source: Studying (science)
cy: Astudio (Gwyddoniaeth)

source: Attending Labs
cy: Mynychu Labordai

source: Attending Lectures
cy: Mynychu Darlithoedd

source: Attending Seminars
cy: Mynychu Seminar

source: Attending Tutorials
cy: Mynychu Tiwtorial

source: Completing Assignment
cy: Cwblhau

source: In an Exam
cy: Mewn Arholiad

source: Preparing a dissertation
cy: Paratoi Traethawd

source: Revising
cy: Adolygu

source: Blogging
cy: Blogio

source: Designing
cy: Dylunio

source: Group Study
cy: Astudio mewn Grwp

source: Practicing
cy: Ymarfer

source: Presenting
cy: Cyflwyno

source: Reading
cy: Darllen

source: Research
cy: Ymchwil

source: Writing
cy: Ysgrifennu

source: Experimenting
cy: Arbrofi

source: Remember me
cy: Cofio fi

source: I accept
cy: Derbyn

source: Reset your password
cy: Adnewyddu Cyfrinair

# it_is_often_forgotten
source: It is often forgotten that password thing. Enter your email address below and click on the ‘Request Password Reset’ button. We will contact you shortly!
cy: it_is_often_forgotten

source: Enter your email address
cy: Eich cyfeiriad ebost

source: Hide Friend
cy: Cyddio Ffrind

source: Delete Friend
cy: Dileu Ffrind

source: Hide Post
cy: Cyddio Post

source: Send Request
cy: Gyrru Cais

source: Unhide
cy: Dadguddio

source: Modules
cy: Modiwlau

source: Compare Engagement
cy: Cymharu Ymrwymiad

source: Log Activity
cy: Logio Actifeddau Diweddar

source: Setup Activity
cy: Creu Actifedd

source: Choose Module and Activity
cy: Dewis Modiwl a Actifedd

source: Activity Details
cy: Manylion Actifedd

source: Activity
cy: Actifedd

source: Trophies Available
cy: Tlysau ar gael

source: My Trophies
cy: Tlysau wedi cael ei ennill

source: Start your new activity
cy: Dechrau eich Actifedd newydd

source: Share
cy: rhannu

source: Set Stretch Goal
cy: Trefnu gol ymestyn

source: Next Target
cy: Targed nesaf

source: Stretch Set
cy: Set Ymestun

source: Startup Screen
cy: Sgrin Cartref

source: Profile
cy: Proffil

source: All friends list
cy: Fy Ffrindiau

source: Select startup screen
cy: Dewis scrin cartref

source: Trophies won
cy: Tlysau wedi Ennill

source: Trophy
cy: Tlws

source: day
cy: Dydd

source: week
cy: Wythnos

source: month
cy: Mis

source: and
cy: ac

source: An unknown error occured. Please try again
cy: Mae nam wedi digwydd - rhaid treial eto

source: Read
cy: Darllen

source: Write
cy: Ysgrifennu

source: Wrote
cy: Wedi ysgrifennu

source: Researched
cy: Ymchwilio

source: Studied
cy: Adolygwyd

source: Design
cy: Dylunio

source: Designed
cy: Dylunwyd

source: Present
cy: Cyflwyno

source: Presented
cy: Cyflwynwyd

source: Blogged
cy: Blogwyd

source: Revise
cy: Adolygu

source: Revised
cy: Adolygwyd

source: Practice
cy: Ymarfer

source: Practiced
cy: Cwblhau Ymarfer

source: Experiment
cy: Arbrofi

source: Experimented
cy: Arbrofwyd

source: Complete Assignment
cy: Gorffen Aseiniad

source: Completed Assignment
cy: Cwblhau Aseiniad

source: Be in an exam
cy: Mewn Arholiad

source: Been in an exam
cy: Cwblhau Arholiad

source: Prepare a dissertation
cy: Paratoi traethawd

source: Prepared a dissertation
cy: Traethawd wedi ei paratoi

source: Attend Lectures
cy: Mynychu Darlith

source: Attended Lectures
cy: Wedi Mynychu Darlith

source: Attend Seminars
cy: Mynychu Seminar

source: Attended Seminars
cy: Wedi mynychu Seminar

source: Attend Tutorials
cy: Mynychu Tiwtorial

source: Attended Tutorials
cy: Wedi mynychu Tiwtorial

source: Attend Labs
cy: Mynychu Labordy

source: Attended Labs
cy: Wedi mynychu Labordy

source: No internet connection detected
cy: Dim cysylltiad rhyngrwyd ar gael

# facebook_settings
source: Go to your device's settings and log in with Facebook to be able to use this functionality
cy: Gosodiadau

source: Not available
cy: ddim ar gael

# twitter_settings
source: Go to your device's settings and log in with Twitter to be able to use this functionality
cy: Gosodiadau

# email_settings
source: Go to your device's settings and log in with an e-mail account to be able to use this functionality
cy: Gosodiadau

source: Please enter your email address
cy: MewnbynnuÂ eich cyfeiriad Ebost

# accept_the_terms_and_conditions
source: You must accept the "Terms and Conditions"
cy: Derbyn termau ac amodau

source: Post Shared Successfully
cy: Neges wedi a Bostio'n Llwyddiannus

source: Nothing to display
cy: Dim i'w ddangos

source: Keep Going
cy: Cadw i fynd

source: I am in the top %@ overall
cy: Rwyf yn y brig yn cyfangwbwl

source: I am in bottom %@ overall
cy: Rwyf yn y gwaelod yn cyfangwbwl

source: Overall engagement
cy: Cyflawn

source: Please select a module
cy: Dewis Modiwl

source: Add
cy: Adio

source: Edit Activity
cy: Golygu

source: Choose Activity Type
cy: Math Actifedd

source: Activity Resumed
cy: Ailddechreuodd

source: Activity Paused
cy: Actifedd wedi ei seibio

source: Saved Successfully
cy: Wedi Cadw

# time_spent_max
source: Time spent cannot be more than %@ hours.
cy: Amser wedi ei gwario ar y mwyaf

source: Choose Interval
cy: Dewis egwyl

source: Are you sure you want you log out?
cy: Ydych yn siwr eich bod eisio all-gofnodi?

source: Set
cy: Creu

source: Add a reason to keep this target
cy: Adio rheswm i gadw'r targed yma

# empty_feed_page_message
source: Welcome to Jisc. This page will be populated with your feeds.
cy: Croeso i Jisc. Bydd y tudalen yma yn cynnwys eich porthiannau

# empty_log_page_message
source: Welcome to Jisc. Start logging your activity by pressing the "+" button.
cy: Croeso i Jisc. Bydd modd cofrestru eich actifedd drwy pwyso'r botwm "+".

# empty_target_page_message
source: Welcome to Jisc. Start adding targets by pressing the "+" button.
cy: Croeso i Jisc. Bydd modd ychwanegu eich targedau drwy pwyso'r botwm "+".

source: Accept
cy: Derbyn

source: Received Request
cy: Cais wedi ei dderbyn

# cancel_pending_request
source: Are you sure you want to cancel your friend request?
cy: Canslo cais sydd ar aros

# no_user_with_this_email
source: There doesn't seem to be a user with this email address. Would you like to invite him to Jisc?
cy: Dim defnyddiwr gyda'r ebost yma

source: Not found
cy: Dim i'w gael

# sent_from
source: Sent from my Study Goal app. www.jisc.ac.uk.
cy: Wedi cael ei gyrru gan

# comparing_my_level_this_week
source: Comparing my level of engagement to others on my course, I am in the %@ this week.
cy: Cymharu fy lefel yr wythnos yma

# comparing_my_level_this_overall
source: Comparing my level of engagement to others on my course, I am in the %@
cy: Cymharu fy lefel yn gyfangwbwl

source: top
cy: Brig

source: bottom
cy: Gwaelod

source: No module
cy: Dim Modiwl

source: Connection problem
cy: Gwall Cysylltiad

# check_internet
source: Check your internet connection and try again later
cy: Gwirio Rhyngrwyd

source: Friend Privacy Settings
cy: Gosodiadau preifatrwydd ffrind

source: Graphs
cy: Gosodiadau

source: Consent
cy: Caniatad

# consent_what_we_want
source: We want to ensure we're giving you the best experience with this app that we can, so we're collecting information on how you're using the app. We're looking at:
cy: Caniatad - Beth rydym angen

# consent_log
source: Log section: We want to know how much time you spend on activities, and what sort of activities you're doing.
cy: Caniatad - Log

# consent_targets
source: Targets section: We want to know how many targets you're setting yourself, how often you're meeting them and whether you're setting stretch goals.
cy: Caniatad - Targedau

# consent_feeds
source: Feeds & Friends: We want to know how many people you're connecting with through this app, and whether you prefer to share your achievements or keep things personal.
cy: Caniatad - Porthiannau

# consent_untick_analytics
source: If you'd rather we didn't do this, that's no problem. Simply untick the box below.
cy: Caniatad - Gwrthod Analytig

# consent_accept_analytics
source: I'm okay with letting you see my usage data.
cy: Caniatad - Derbyn Analytig

# consent_privacy
source: To make it easier for everyone to connect with each other, we show users who else on their course are using this app (Go to the search page in the friends section to see). None of your personal information is shared until you become friends with another user. If you'd rather other people on your course not see you here, you can untick the box below.
cy: Caniatad - Preifatrwydd

# consent_accept_privacy
source: I'm happy for other people to see that I use this app too.
cy: Caniatad - Derbyn preifatrwydd

# consent_many_thanks
source: Many thanks,
cy: Caniatad - Diolch yn fawr

# consent_jisc
source: Jisc
cy: Caniatad - Jisc

# search_by_email
source: Search for friend by email address
cy: Edrych gyda ebost

# session_expired_title
source: Session expired
cy: Edrych am ffrind gyda cyfeiriad ebost

# session_expired_message
source: Your session expired. You need to login again to continue using the app.
cy: Mae eich sesiwn wedi gorffen. Bydd rhaid ail-ymuno a'r system i barhau

# top_10_percent
source: Top 10
cy: 10 Uchaf

source: Average
cy: Cyfartaledd

source: for
cy: ar gyfer

source: every
cy: pob

# log_recent
source: Report Completed Activity
cy: Cofnodi Actifedd wedi ei Cwblhau

# report_activity
source: Start Activity Now (Timed)
cy: Dechrau Actifedd Nawr (Amseru)

source: Send Friend Request
cy: Gyrru Cais Ffrind

source: Please search for friends using their institution email address
cy: I chwilio am ffrindiau, defnyddiwch ei cyfeiriad ebost nhw (o fewn ei sefydliad)

# report_a_bug
source: Report Feature / Bug
cy: Cofnodi Nodwedd / Nam

source: Student ID
cy: Rhif Myfyriwr

source: Bug/Feature idea
cy: Cofnodi Nodwedd/Nam

# bug_or_feature
source: Is this a bug, or feature request?
cy: Nam gyda’r app ydy hwn, neu cofnod o nodwedd newydd ar gyfer yr app?

# affected_parts
source: Which part or area of the app is this relevant to (feeds, stats, logs, targets, or another area)?
cy: Mewn pa rhan o’r app mae hwn yn briodol iddo (porthiant, ystadegau, log, target, neu rhywle arall)?

# further_details
source: Further Detail:
cy: Gwybodaeth bellach:

source: Filter
cy: Hidlydd

source: All Activity
cy: Pob gweithgaredd

source: You earned
cy: Rydych wedi ennill

# no_requests
source: You do not have any new friend requests at the moment.
cy: Does dim ceisiadau ffrind newydd gyda chi ar y foment.

# do_you_want_to_respond
source: Do you want to respond now?
cy: Ydych eisiau ymateb nawr?
